Revit 2027 API
PanelScheduleData.BorderAroundSchedule Property
 Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BorderAroundSchedule { get; }
Public ReadOnly Property BorderAroundSchedule As ElementId
	Get
public:
property ElementId^ BorderAroundSchedule {
	ElementId^ get ();
}
member BorderAroundSchedule : ElementId with get
Property Value
ElementId
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace